# -*- coding: utf-8 -*-
"""Задание 1.1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1ZteCFew6MxxsPyMplEIsNDxs6K8tFRuL

Посмотреть документацию к API GitHub, разобраться как вывести список репозиториев для конкретного пользователя, сохранить JSON-вывод в файле *.json.
"""

import requests
import json

url = 'https://api.github.com'
user='EgeniyaKlochneva'

response = requests.get(f'{url}/users/{user}/repos')

with open('data.json', 'w') as k:
    json.dump(response.json(), k)

for i in response.json():
    print(i['name'])